In [1]:
### Expressions :
***
`\d`  Any numeric digit from `0` to `9`.
`\D`  Matches any character which is not a decimal digit.
      This is the opposite of `\d`.
`\w`  Any letter, numeric digit, or the underscore
     character.  (Think of this as matching"word" characters.)
`\W`  Any character that is not a letter,numeric digit, or the underscore character.

In [39]:
import re 
import pandas as pd

In [2]:
text = "A32B"

In [3]:
num = re.search("\d\d",text)

In [4]:
num

In [5]:
num.group()

'32'

In [9]:
num = re.search("\d\d\d",text)

In [8]:
num

In [14]:
text1 = "4PM"

In [15]:
nondeci = re.search("\D",text1)

In [16]:
nondeci.group()

'P'

In [21]:
text2 = "My phone number is 05001234567"
re.search("\d\d\d\d\d\d\d\d\d\d\d", text2)

In [25]:
text2 = "My phone number is 05001234567"
a = re.search("(\d\d\d)(\d\d\d)(\d\d\d\d)", text2)
a.group(3)

'3456'

In [29]:
value = "O 1, t 10 , o 100. 10000"
output = re.findall("\d{1,2}",value) # {1,2} - iki basamaklı sayılara kadar olanı al
print(output)

['1', '10', '10', '0', '10', '00', '0']

In [30]:
value = "O 1, t 10 , o 100. 10000"
output = re.findall("\d{1,6}",value) 
print(output)

['1', '10', '100', '10000']

In [32]:
phone = "2004-959-559 # This is Phone Number"
output = re.sub("\D","",phone)
print(output)

2004959559

In [33]:
phone = "2004-959-559 # This is Phone Number"
output = re.sub("\D",".",phone)
print(output)

2004.959.559.......................

In [34]:
s = pd.Series(["a3","b4","c5"])

In [35]:
s.str.extract("(\d)")

   0
0  3
1  4
2  5

In [36]:
s.str.extract("(\d\d)")

     0
0  NaN
1  NaN
2  NaN

In [37]:
s = pd.Series(["a3","b44","c5"])
s.str.extract("(\d\d)")

     0
0  NaN
1   44
2  NaN

In [38]:
s = pd.Series(["a3","b44","c5"])
s.str.extract("(\D)")

   0
0  a
1  b
2  c

In [42]:
s = pd.Series(["a3aa","b4aa","c5aa"])
s.str.extract("(\w)\d(\w)(\w)")

   0  1  2
0  a  a  a
1  b  a  a
2  c  a  a

In [47]:
s= pd.Series(['40 l/100 km (comb)', 
        '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',
       '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)', 
       '7.8 l/100 km (comb)'])
s.str.extract("(\d\d|\d.\d|\d)")

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8